#include "mainwindow.h"
#include "pages_adminlogin.h"
#include <QApplication>
#include "iostream"

using namespace std;
int main(int argc, char *argv[])
{
    QApplication a(argc, argv);
    MainWindow w;
    w.show();
    return a.exec();

    {
        //    QString arr[106] = { "安康","澳门","白山","包头","北海","常德","常州","长春","大连","大阪","东京","东营","敦煌","恩施","福州","阜阳","广元","广州","桂林","贵阳","哈尔滨","邯郸","杭州","菏泽","合肥","衡阳","呼和浩特","怀化","淮安","济南","加格达奇","揭阳","金边","井冈山","喀什","克拉玛依","昆明","兰州","丽江","临沂","柳州","洛阳","曼谷","绵阳","南昌","南充","南京","南宁","南通","南阳","宁波","黔江","青岛","庆阳","琼海","泉州(晋江)","三明","三亚","上海","厦门","上饶","邵阳","深圳","沈阳","十堰(武当山)","石河子","石家庄","首尔","松原","太原","天津","通化","通辽","威海","温州","文山","乌海","乌鲁木齐","无锡","武汉","武隆(重庆)","西安","西宁","西双版纳","襄阳","忻州","烟台","盐城","延安","扬州(泰州)","伊宁","宜宾","银川","榆林","岳阳","湛江","张家口","张掖","泸州","长沙","成都","郑州","重庆","舟山","珠海","遵义(茅台)" };
        //    int i;
        //    int N = 106;
        //    quick_sort(arr, 0, N - 1);
        //    insert_sort(arr,106);
        //    qDebug()<<" 排序后 ";
        //    for (i = 0; i < N; i++)
        //        qDebug()<< arr[i];
    }
//    test_getId();


    return 0;
}
